{"_path":"/about","_dir":"","_draft":false,"_partial":false,"_locale":"","title":"About","description":"About Me ","readingTime":{"text":"2 min read","minutes":1.47,"time":88200,"words":294},"body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"span","props":{"className":["text-3xl"]},"children":[{"type":"text","value":"About Me "},{"type":"element","tag":"icon","props":{"name":"carbon:id-management","className":["ml-2"]},"children":[]}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I am a passionate advocate for "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"open source"}]},{"type":"text","value":" and sharing knowledge. With a deep-rooted love for computers and technology from an early age, I embarked on my coding journey, developing my first website at the age of twelve. Since then, my fascination with the endless possibilities of technology has only grown stronger."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"As of now I am supporting several customers as a freelance software engineer and consultant."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Beforehand I was serving as the Principal Engineer for the Apps & Store Touchpoints domain of MediamarktSaturn Technology, I have been entrusted with the responsibility of overseeing the entire domain. In this role, I drive technical improvements for overarching topics, including stabilizing product teams, making critical architecture decisions, providing guidance on technology choices, and conducting thorough analyses of technical debt. By spearheading these initiatives, I strive to enhance efficiency, maintain a robust infrastructure, and ensure exceptional user experiences across our services."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Throughout my career, I have gained expertise in a diverse range of technologies and frameworks, enabling me to leverage the most suitable tools for the task at hand. My proficiency lies in driving innovation, streamlining processes, and maximizing the potential of our technical resources."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Previously, I held the position of Senior Lead Engineer at MediaMarktSaturn Technology, where I successfully led a team responsible for calculating delivery times, providing delivery promises, managing product reservations, and implementing distribution rules. Leveraging technologies such as Spring Boot, Quarkus, and Kotlin, I delivered high-quality solutions that optimized operational efficiency and customer satisfaction."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Prior to my tenure at MediaMarktSaturn, I worked at vogella GmbH, an esteemed open-source company founded by Java Champion Lars Vogel. During this time, I conducted comprehensive training sessions, delivered talks and workshops at prominent industry events, and actively contributed to open source projects, solidifying my commitment to knowledge acquisition and distribution."}]}],"toc":{"title":"","searchDepth":3,"depth":3,"links":[]}},"_type":"markdown","_id":"content:about.md","_source":"content","_file":"about.md","_stem":"about","_extension":"md"}